In [20]:
import pandas as pd 
import numpy as np

In [21]:
a =[1,2,3]

In [22]:
a

[1, 2, 3]

In [23]:
df =pd.Series(a,name ='Name')

In [24]:
print(df)

0    1
1    2
2    3
Name: Name, dtype: int64

In [25]:
d ={"Atul":98 ,"Kunal":77}
df =pd.Series(d)

In [26]:
df

Atul     98
Kunal    77
dtype: int64

In [27]:
pd.DataFrame(df)

        0
Atul   98
Kunal  77

In [28]:
a ={
    "Name" : ["Alice","Bob","Charlie","David"],
    "Marks" :[12,33,44,43],
    "Score" :[88,77,98,97]
}
df =pd.DataFrame(a)

In [29]:
df.head(3)

      Name  Marks  Score
0    Alice     12     88
1      Bob     33     77
2  Charlie     44     98

In [30]:
df.tail(2)

      Name  Marks  Score
2  Charlie     44     98
3    David     43     97

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Marks   4 non-null      int64
 2   Score   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [32]:
df.isnull().sum()

Name     0
Marks    0
Score    0
dtype: int64

In [33]:
df.shape

(4, 3)

In [34]:
df.size

12

In [35]:
df.dtypes

Name     object
Marks     int64
Score     int64
dtype: object

In [36]:
df["Name"]

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [37]:
df.loc[2]

Name     Charlie
Marks         44
Score         98
Name: 2, dtype: object

In [38]:
df

      Name  Marks  Score
0    Alice     12     88
1      Bob     33     77
2  Charlie     44     98
3    David     43     97

In [39]:
df.loc[1:2,["Name","Score"]]

      Name  Score
1      Bob     77
2  Charlie     98

In [40]:
df.head()

      Name  Marks  Score
0    Alice     12     88
1      Bob     33     77
2  Charlie     44     98
3    David     43     97

In [41]:
df.rename(columns={"Marks":"Age"},inplace =True)

In [42]:
df

      Name  Age  Score
0    Alice   12     88
1      Bob   33     77
2  Charlie   44     98
3    David   43     97

In [43]:
data ={
    "Name" : ["A","B","C","D"],
    "Age" : [21,22,33,12],
    "City" :["Mumbai","Delhi","Kolkata","Pune"], 
    "Score" :[78,87,98,76]
}
df =pd.DataFrame(data)

In [44]:
df

  Name  Age     City  Score
0    A   21   Mumbai     78
1    B   22    Delhi     87
2    C   33  Kolkata     98
3    D   12     Pune     76

In [45]:
df.head(3)

  Name  Age     City  Score
0    A   21   Mumbai     78
1    B   22    Delhi     87
2    C   33  Kolkata     98

In [46]:
df.tail(2)

  Name  Age     City  Score
2    C   33  Kolkata     98
3    D   12     Pune     76

In [47]:
df

  Name  Age     City  Score
0    A   21   Mumbai     78
1    B   22    Delhi     87
2    C   33  Kolkata     98
3    D   12     Pune     76

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
 3   Score   4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes

In [49]:
df[["Name","Age"]]

  Name  Age
0    A   21
1    B   22
2    C   33
3    D   12

In [50]:
df

  Name  Age     City  Score
0    A   21   Mumbai     78
1    B   22    Delhi     87
2    C   33  Kolkata     98
3    D   12     Pune     76

In [51]:
df.rename(columns={"Age":"AGE"})

  Name  AGE     City  Score
0    A   21   Mumbai     78
1    B   22    Delhi     87
2    C   33  Kolkata     98
3    D   12     Pune     76

In [52]:
df.shape

(4, 4)

In [53]:
df.dtypes

Name     object
Age       int64
City     object
Score     int64
dtype: object

In [54]:
df.columns

Index(['Name', 'Age', 'City', 'Score'], dtype='object')

In [55]:
a ={
    "Name": ["Alice","Bob","Charlie","David","Emma"],
    "Age": [21,None,22,23,32], 
    "City": ["Delhi","Mumbai",None,"Bangalore","Chennai"],
    "Score": [56,77,np.nan,88,87]
}

df =pd.DataFrame(a)

In [56]:
df

      Name   Age       City  Score
0    Alice  21.0      Delhi   56.0
1      Bob   NaN     Mumbai   77.0
2  Charlie  22.0       None    NaN
3    David  23.0  Bangalore   88.0
4     Emma  32.0    Chennai   87.0

In [57]:
df.isnull().sum()

Name     0
Age      1
City     1
Score    1
dtype: int64

In [58]:
df.dropna()

    Name   Age       City  Score
0  Alice  21.0      Delhi   56.0
3  David  23.0  Bangalore   88.0
4   Emma  32.0    Chennai   87.0

In [59]:
df

      Name   Age       City  Score
0    Alice  21.0      Delhi   56.0
1      Bob   NaN     Mumbai   77.0
2  Charlie  22.0       None    NaN
3    David  23.0  Bangalore   88.0
4     Emma  32.0    Chennai   87.0

In [60]:
df["Age"] =df["Age"].fillna(df["Age"].mean())

In [61]:
df

      Name   Age       City  Score
0    Alice  21.0      Delhi   56.0
1      Bob  24.5     Mumbai   77.0
2  Charlie  22.0       None    NaN
3    David  23.0  Bangalore   88.0
4     Emma  32.0    Chennai   87.0

In [62]:
df["Score"] =df["Score"].fillna(df["Score"].mean())

In [63]:
df

      Name   Age       City  Score
0    Alice  21.0      Delhi   56.0
1      Bob  24.5     Mumbai   77.0
2  Charlie  22.0       None   77.0
3    David  23.0  Bangalore   88.0
4     Emma  32.0    Chennai   87.0

In [64]:
df["City"] =df["City"].fillna(df["City"].mode())

In [65]:
df

      Name   Age       City  Score
0    Alice  21.0      Delhi   56.0
1      Bob  24.5     Mumbai   77.0
2  Charlie  22.0      Delhi   77.0
3    David  23.0  Bangalore   88.0
4     Emma  32.0    Chennai   87.0

In [66]:
df.isnull().sum()

Name     0
Age      0
City     0
Score    0
dtype: int64

In [67]:
df.dtypes

Name      object
Age      float64
City      object
Score    float64
dtype: object

In [68]:
df["Age"] =df["Age"].astype(int)

In [69]:
df.dtypes

Name      object
Age        int32
City      object
Score    float64
dtype: object

In [70]:
df

      Name  Age       City  Score
0    Alice   21      Delhi   56.0
1      Bob   24     Mumbai   77.0
2  Charlie   22      Delhi   77.0
3    David   23  Bangalore   88.0
4     Emma   32    Chennai   87.0

In [71]:
df["Name"] =df["Name"].replace("Bob","Atul")

In [72]:
df

      Name  Age       City  Score
0    Alice   21      Delhi   56.0
1     Atul   24     Mumbai   77.0
2  Charlie   22      Delhi   77.0
3    David   23  Bangalore   88.0
4     Emma   32    Chennai   87.0

In [73]:
df['Score'] =df["Score"].astype(int)

In [74]:
df

      Name  Age       City  Score
0    Alice   21      Delhi     56
1     Atul   24     Mumbai     77
2  Charlie   22      Delhi     77
3    David   23  Bangalore     88
4     Emma   32    Chennai     87

In [75]:
df.drop(["Name"],axis=1)

   Age       City  Score
0   21      Delhi     56
1   24     Mumbai     77
2   22      Delhi     77
3   23  Bangalore     88
4   32    Chennai     87

In [76]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [77]:
df.drop_duplicates(inplace=True)

In [78]:
df

      Name  Age       City  Score
0    Alice   21      Delhi     56
1     Atul   24     Mumbai     77
2  Charlie   22      Delhi     77
3    David   23  Bangalore     88
4     Emma   32    Chennai     87

In [79]:
data = {
    "Name": ["Alice", "Bob", "Chrlie", "David", "Alice", None],
    "Age": ["25", "30", None, "40", "25", "30"],      # ages stored as strings, with missing value
    "City": ["Delhi", "Mumbai", "Pun", "Bangalore", "Delhi", "Mumbai"],  # typo: "Pun" -> "Pune"
    "Score": [85, None, 78, 88, 85, 91],              # missing value in Score
    "Extra": ["x", "y", "z", "x", "y", "z"]           # extra column we don't really need
}

df = pd.DataFrame(data)

In [80]:
df

     Name   Age       City  Score Extra
0   Alice    25      Delhi   85.0     x
1     Bob    30     Mumbai    NaN     y
2  Chrlie  None        Pun   78.0     z
3   David    40  Bangalore   88.0     x
4   Alice    25      Delhi   85.0     y
5    None    30     Mumbai   91.0     z

In [81]:
df.shape

(6, 5)

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      object
 2   City    6 non-null      object
 3   Score   5 non-null      float64
 4   Extra   6 non-null      object
dtypes: float64(1), object(4)
memory usage: 372.0+ bytes

In [83]:
df.size

30

In [84]:
df.isnull().sum()

Name     1
Age      1
City     0
Score    1
Extra    0
dtype: int64

In [85]:
df.head()

     Name   Age       City  Score Extra
0   Alice    25      Delhi   85.0     x
1     Bob    30     Mumbai    NaN     y
2  Chrlie  None        Pun   78.0     z
3   David    40  Bangalore   88.0     x
4   Alice    25      Delhi   85.0     y

In [86]:
df["Score"] =df["Score"].fillna(df["Score"].mean())

In [87]:
df.head()

     Name   Age       City  Score Extra
0   Alice    25      Delhi   85.0     x
1     Bob    30     Mumbai   85.4     y
2  Chrlie  None        Pun   78.0     z
3   David    40  Bangalore   88.0     x
4   Alice    25      Delhi   85.0     y

In [88]:
df.dtypes

Name      object
Age       object
City      object
Score    float64
Extra     object
dtype: object

In [89]:
df["Age"] =df['Age'].astype(float)

In [90]:
df.dtypes

Name      object
Age      float64
City      object
Score    float64
Extra     object
dtype: object

In [91]:
df

     Name   Age       City  Score Extra
0   Alice  25.0      Delhi   85.0     x
1     Bob  30.0     Mumbai   85.4     y
2  Chrlie   NaN        Pun   78.0     z
3   David  40.0  Bangalore   88.0     x
4   Alice  25.0      Delhi   85.0     y
5    None  30.0     Mumbai   91.0     z

In [92]:
df["Age"] =df["Age"].fillna(df["Age"].mean())

In [93]:
df

     Name   Age       City  Score Extra
0   Alice  25.0      Delhi   85.0     x
1     Bob  30.0     Mumbai   85.4     y
2  Chrlie  30.0        Pun   78.0     z
3   David  40.0  Bangalore   88.0     x
4   Alice  25.0      Delhi   85.0     y
5    None  30.0     Mumbai   91.0     z

In [94]:
df["City"] =df["City"].replace({"Pun":"Pune"})

In [95]:
df.head()

     Name   Age       City  Score Extra
0   Alice  25.0      Delhi   85.0     x
1     Bob  30.0     Mumbai   85.4     y
2  Chrlie  30.0       Pune   78.0     z
3   David  40.0  Bangalore   88.0     x
4   Alice  25.0      Delhi   85.0     y

In [96]:
df.drop_duplicates(inplace=True)

In [97]:
df

     Name   Age       City  Score Extra
0   Alice  25.0      Delhi   85.0     x
1     Bob  30.0     Mumbai   85.4     y
2  Chrlie  30.0       Pune   78.0     z
3   David  40.0  Bangalore   88.0     x
4   Alice  25.0      Delhi   85.0     y
5    None  30.0     Mumbai   91.0     z

In [98]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     6 non-null      float64
 2   City    6 non-null      object
 3   Score   6 non-null      float64
 4   Extra   6 non-null      object
dtypes: float64(2), object(3)
memory usage: 372.0+ bytes

In [99]:
df.isnull().sum()

Name     1
Age      0
City     0
Score    0
Extra    0
dtype: int64

In [100]:
df["Name"] =df["Name"].fillna(df["Name"].mode())

In [101]:
df

     Name   Age       City  Score Extra
0   Alice  25.0      Delhi   85.0     x
1     Bob  30.0     Mumbai   85.4     y
2  Chrlie  30.0       Pune   78.0     z
3   David  40.0  Bangalore   88.0     x
4   Alice  25.0      Delhi   85.0     y
5     NaN  30.0     Mumbai   91.0     z

In [102]:
df.head()

     Name   Age       City  Score Extra
0   Alice  25.0      Delhi   85.0     x
1     Bob  30.0     Mumbai   85.4     y
2  Chrlie  30.0       Pune   78.0     z
3   David  40.0  Bangalore   88.0     x
4   Alice  25.0      Delhi   85.0     y

In [103]:
df[df["Age"]>25]

     Name   Age       City  Score Extra
1     Bob  30.0     Mumbai   85.4     y
2  Chrlie  30.0       Pune   78.0     z
3   David  40.0  Bangalore   88.0     x
5     NaN  30.0     Mumbai   91.0     z

In [104]:
df[(df["Age"]>30) & (df["Score"]>85)]

    Name   Age       City  Score Extra
3  David  40.0  Bangalore   88.0     x

In [105]:
df.query("Age>25")

     Name   Age       City  Score Extra
1     Bob  30.0     Mumbai   85.4     y
2  Chrlie  30.0       Pune   78.0     z
3   David  40.0  Bangalore   88.0     x
5     NaN  30.0     Mumbai   91.0     z

In [106]:
df.query("Age<40 and Score >=85" )

    Name   Age    City  Score Extra
0  Alice  25.0   Delhi   85.0     x
1    Bob  30.0  Mumbai   85.4     y
4  Alice  25.0   Delhi   85.0     y
5    NaN  30.0  Mumbai   91.0     z

In [107]:
df["Name"].str.upper()

0     ALICE
1       BOB
2    CHRLIE
3     DAVID
4     ALICE
5       NaN
Name: Name, dtype: object

In [108]:
df

     Name   Age       City  Score Extra
0   Alice  25.0      Delhi   85.0     x
1     Bob  30.0     Mumbai   85.4     y
2  Chrlie  30.0       Pune   78.0     z
3   David  40.0  Bangalore   88.0     x
4   Alice  25.0      Delhi   85.0     y
5     NaN  30.0     Mumbai   91.0     z

In [109]:
df["Name"].str.replace("Alice","Atul")

0      Atul
1       Bob
2    Chrlie
3     David
4      Atul
5       NaN
Name: Name, dtype: object

In [110]:
df

     Name   Age       City  Score Extra
0   Alice  25.0      Delhi   85.0     x
1     Bob  30.0     Mumbai   85.4     y
2  Chrlie  30.0       Pune   78.0     z
3   David  40.0  Bangalore   88.0     x
4   Alice  25.0      Delhi   85.0     y
5     NaN  30.0     Mumbai   91.0     z

In [111]:
data ={
    "Name" :["Alice","Bob","Charlie","David","Emma","Frank"],
    "Age" :[21,54,22,43,22,55], 
    "City" :["Delhi","Mumbai","Pune","Chennai","Delhi","Mumbai"],
    "Score" :[45,90,87,78,99,100]
}

df =pd.DataFrame(data)

In [112]:
df

      Name  Age     City  Score
0    Alice   21    Delhi     45
1      Bob   54   Mumbai     90
2  Charlie   22     Pune     87
3    David   43  Chennai     78
4     Emma   22    Delhi     99
5    Frank   55   Mumbai    100

In [113]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   City    6 non-null      object
 3   Score   6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [114]:
df.query("Age>25")

    Name  Age     City  Score
1    Bob   54   Mumbai     90
3  David   43  Chennai     78
5  Frank   55   Mumbai    100

In [115]:
df.query("City=='Delhi' or City=='Mumbai'")

    Name  Age    City  Score
0  Alice   21   Delhi     45
1    Bob   54  Mumbai     90
4   Emma   22   Delhi     99
5  Frank   55  Mumbai    100

In [116]:
df.query("Age>=15 and Age<35")

      Name  Age   City  Score
0    Alice   21  Delhi     45
2  Charlie   22   Pune     87
4     Emma   22  Delhi     99

In [117]:
df["Name"].str.upper()

0      ALICE
1        BOB
2    CHARLIE
3      DAVID
4       EMMA
5      FRANK
Name: Name, dtype: object

In [118]:
df["Name"].str.lower()

0      alice
1        bob
2    charlie
3      david
4       emma
5      frank
Name: Name, dtype: object

In [119]:
import pandas as pd 
import numpy as np

data ={
    "product" :["pen","Notebook","Pencil","Marker","Eraser","Sharpener"], 
    "Price" :[10,50,5,30,8,12], 
    "Stock" :[100,60,200,80,150,120], 
    "Rating" :[4.5,4.7,4.9,4.3,5.5,4.2]
}

df =pd.DataFrame(data)

In [120]:
df.head()

    product  Price  Stock  Rating
0       pen     10    100     4.5
1  Notebook     50     60     4.7
2    Pencil      5    200     4.9
3    Marker     30     80     4.3
4    Eraser      8    150     5.5

In [121]:
df.sort_values(by ='Price',ascending=False)

     product  Price  Stock  Rating
1   Notebook     50     60     4.7
3     Marker     30     80     4.3
5  Sharpener     12    120     4.2
0        pen     10    100     4.5
4     Eraser      8    150     5.5
2     Pencil      5    200     4.9

In [122]:
df.sort_values(by =["Price","Stock"],ascending=[True,False])

     product  Price  Stock  Rating
2     Pencil      5    200     4.9
4     Eraser      8    150     5.5
0        pen     10    100     4.5
5  Sharpener     12    120     4.2
3     Marker     30     80     4.3
1   Notebook     50     60     4.7

In [123]:
df.mean(numeric_only=True)

Price      19.166667
Stock     118.333333
Rating      4.683333
dtype: float64

In [124]:
df.median(numeric_only=True)

Price      11.0
Stock     110.0
Rating      4.6
dtype: float64

In [125]:
df.describe()

           Price       Stock    Rating
count   6.000000    6.000000  6.000000
mean   19.166667  118.333333  4.683333
std    17.486185   50.760877  0.475044
min     5.000000   60.000000  4.200000
25%     8.500000   85.000000  4.350000
50%    11.000000  110.000000  4.600000
75%    25.500000  142.500000  4.850000
max    50.000000  200.000000  5.500000

In [126]:
df['product'].value_counts()

product
pen          1
Notebook     1
Pencil       1
Marker       1
Eraser       1
Sharpener    1
Name: count, dtype: int64

In [127]:
df.corr(numeric_only=True)

           Price     Stock    Rating
Price   1.000000 -0.804028 -0.257222
Stock  -0.804028  1.000000  0.496261
Rating -0.257222  0.496261  1.000000

In [128]:
df['Price'].corr(df['Stock'])

-0.8040280933316356

In [129]:
data ={
    "Name" : ["Alice","Bob","Charlie","David","Emma"], 
    "Age" : [25,30,35,40,22], 
    "Score" : [88,92,79,85,95], 
    "Height" : [160,175,168,180,158]
}

df =pd.DataFrame(data)

In [130]:
df

      Name  Age  Score  Height
0    Alice   25     88     160
1      Bob   30     92     175
2  Charlie   35     79     168
3    David   40     85     180
4     Emma   22     95     158

In [131]:
df.sort_values("Score",ascending=False)

      Name  Age  Score  Height
4     Emma   22     95     158
1      Bob   30     92     175
0    Alice   25     88     160
3    David   40     85     180
2  Charlie   35     79     168

In [132]:
df.describe()

             Age      Score      Height
count   5.000000   5.000000    5.000000
mean   30.400000  87.800000  168.200000
std     7.300685   6.220932    9.444575
min    22.000000  79.000000  158.000000
25%    25.000000  85.000000  160.000000
50%    30.000000  88.000000  168.000000
75%    35.000000  92.000000  175.000000
max    40.000000  95.000000  180.000000

In [133]:
df.value_counts(["Name","Age"])

Name     Age
Alice    25     1
Bob      30     1
Charlie  35     1
David    40     1
Emma     22     1
Name: count, dtype: int64

In [134]:
df.corr(numeric_only=True)

             Age     Score    Height
Age     1.000000 -0.718893  0.868722
Score  -0.718893  1.000000 -0.331041
Height  0.868722 -0.331041  1.000000

In [135]:
df.cov(numeric_only=True)

          Age  Score  Height
Age     53.30 -32.65   59.90
Score  -32.65  38.70  -19.45
Height  59.90 -19.45   89.20

In [136]:
df.value_counts(normalize=True)

Name     Age  Score  Height
Alice    25   88     160       0.2
Bob      30   92     175       0.2
Charlie  35   79     168       0.2
David    40   85     180       0.2
Emma     22   95     158       0.2
Name: proportion, dtype: float64

In [137]:
data ={
    "Employee" : ["John","Sarah","Mike","Anna","Tom","Laura","Steve","Kate"], 
    "Department" : ['HR','IT','IT','Finance','Finance','HR','IT','Finance'],
    "Salary" : [50000,70000,72000,65000,60000,52000,75000,58000], 
    "Age" : [28,32,30,27,35,29,31,26]
}

df =pd.DataFrame(data)

In [138]:
df.head()

  Employee Department  Salary  Age
0     John         HR   50000   28
1    Sarah         IT   70000   32
2     Mike         IT   72000   30
3     Anna    Finance   65000   27
4      Tom    Finance   60000   35

In [139]:
df['Department'].value_counts()

Department
IT         3
Finance    3
HR         2
Name: count, dtype: int64

In [140]:
df[df['Department']=='IT']['Salary'].mean()

72333.33333333333

In [141]:
df.groupby("Department")['Salary'].mean()

Department
Finance    61000.000000
HR         51000.000000
IT         72333.333333
Name: Salary, dtype: float64

In [142]:
df.groupby("Department")['Employee'].count()

Department
Finance    3
HR         2
IT         3
Name: Employee, dtype: int64

In [143]:
df.groupby("Department")['Employee'].agg(['min','max'])

             min    max
Department
Finance     Anna    Tom
HR          John  Laura
IT          Mike  Steve

In [144]:
df.head()

  Employee Department  Salary  Age
0     John         HR   50000   28
1    Sarah         IT   70000   32
2     Mike         IT   72000   30
3     Anna    Finance   65000   27
4      Tom    Finance   60000   35

In [145]:
df.groupby("Department").agg(
    {"Salary":['mean','max','min'],
    "Age" :['mean','max']})

                  Salary                      Age
                    mean    max    min       mean max
Department
Finance     61000.000000  65000  58000  29.333333  35
HR          51000.000000  52000  50000  28.500000  29
IT          72333.333333  75000  70000  31.000000  32

In [146]:
df.pivot_table(values="Salary",index ="Department",aggfunc="mean")

                  Salary
Department
Finance     61000.000000
HR          51000.000000
IT          72333.333333

In [147]:
import numpy as np 
import pandas as pd

In [148]:
arr =[1,2,34,3]
a =pd.Series(arr,name ="Kunal")

In [149]:
print(a)

0     1
1     2
2    34
3     3
Name: Kunal, dtype: int64

In [150]:
d ={"Atul":98 ,"Kunal":77} 
df =pd.Series(d)
df

Atul     98
Kunal    77
dtype: int64

In [151]:
a ={
    "Name" : ["Alice","Bob","Charlie","David"],
    "Marks" :[12,33,44,43],
    "Score" :[88,77,98,97]
} 

df =pd.DataFrame(a)

In [152]:
df

      Name  Marks  Score
0    Alice     12     88
1      Bob     33     77
2  Charlie     44     98
3    David     43     97

In [153]:
df.head()

      Name  Marks  Score
0    Alice     12     88
1      Bob     33     77
2  Charlie     44     98
3    David     43     97

In [154]:
df.tail()

      Name  Marks  Score
0    Alice     12     88
1      Bob     33     77
2  Charlie     44     98
3    David     43     97

In [155]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Marks   4 non-null      int64
 2   Score   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [156]:
df.isnull().sum()

Name     0
Marks    0
Score    0
dtype: int64

In [157]:
df.shape

(4, 3)

In [158]:
df.dtypes

Name     object
Marks     int64
Score     int64
dtype: object

In [159]:
df

      Name  Marks  Score
0    Alice     12     88
1      Bob     33     77
2  Charlie     44     98
3    David     43     97

In [160]:
df[['Name','Marks']]

      Name  Marks
0    Alice     12
1      Bob     33
2  Charlie     44
3    David     43

In [161]:
df.loc[1:2,["Name","Marks"]]

      Name  Marks
1      Bob     33
2  Charlie     44

In [162]:
df.iloc[1:2]

  Name  Marks  Score
1  Bob     33     77

In [163]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [164]:
df.columns

Index(['Name', 'Marks', 'Score'], dtype='object')

In [165]:
df.rename(columns={'Name':'NAME'},inplace=True)

In [166]:
df

      NAME  Marks  Score
0    Alice     12     88
1      Bob     33     77
2  Charlie     44     98
3    David     43     97

In [167]:
df.loc[0]

NAME     Alice
Marks       12
Score       88
Name: 0, dtype: object

In [168]:
df.reset_index(inplace=True)

In [169]:
df

   index     NAME  Marks  Score
0      0    Alice     12     88
1      1      Bob     33     77
2      2  Charlie     44     98
3      3    David     43     97

In [170]:
df

   index     NAME  Marks  Score
0      0    Alice     12     88
1      1      Bob     33     77
2      2  Charlie     44     98
3      3    David     43     97

In [171]:
data ={
    "Name" :["Alice","Bob","Charlie","David","Emma","Frank"],
    "Age" :[21,54,22,43,22,55], 
    "City" :["Delhi","Mumbai","Pune","Chennai","Delhi","Mumbai"],
    "Score" :[45,90,87,78,99,100]
}

df =pd.DataFrame(data)

In [172]:
df

      Name  Age     City  Score
0    Alice   21    Delhi     45
1      Bob   54   Mumbai     90
2  Charlie   22     Pune     87
3    David   43  Chennai     78
4     Emma   22    Delhi     99
5    Frank   55   Mumbai    100

In [173]:
df.head(3)

      Name  Age    City  Score
0    Alice   21   Delhi     45
1      Bob   54  Mumbai     90
2  Charlie   22    Pune     87

In [174]:
df.tail(2)

    Name  Age    City  Score
4   Emma   22   Delhi     99
5  Frank   55  Mumbai    100

In [175]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   City    6 non-null      object
 3   Score   6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [176]:
df

      Name  Age     City  Score
0    Alice   21    Delhi     45
1      Bob   54   Mumbai     90
2  Charlie   22     Pune     87
3    David   43  Chennai     78
4     Emma   22    Delhi     99
5    Frank   55   Mumbai    100

In [177]:
df[['Name','Age']]

      Name  Age
0    Alice   21
1      Bob   54
2  Charlie   22
3    David   43
4     Emma   22
5    Frank   55

In [178]:
df.rename(columns={'Name':'NAME'})

      NAME  Age     City  Score
0    Alice   21    Delhi     45
1      Bob   54   Mumbai     90
2  Charlie   22     Pune     87
3    David   43  Chennai     78
4     Emma   22    Delhi     99
5    Frank   55   Mumbai    100

In [179]:
df.shape

(6, 4)

In [180]:
df.dtypes

Name     object
Age       int64
City     object
Score     int64
dtype: object

In [181]:
df.columns

Index(['Name', 'Age', 'City', 'Score'], dtype='object')

In [182]:
import pandas as pd 
import numpy as np  

data ={
    "Name" :["Alice","Bob","Charlie","David","Emma","Frank"],
    "Age" :[21,54,22,43,22,55], 
    "City" :["Delhi","Mumbai","Pune","Chennai","Delhi","Mumbai"],
    "Score" :[45,90,87,78,99,100]
}

df =pd.DataFrame(data)

In [183]:
df

      Name  Age     City  Score
0    Alice   21    Delhi     45
1      Bob   54   Mumbai     90
2  Charlie   22     Pune     87
3    David   43  Chennai     78
4     Emma   22    Delhi     99
5    Frank   55   Mumbai    100

In [184]:
df.isnull().sum()

Name     0
Age      0
City     0
Score    0
dtype: int64

In [185]:
df.dropna()

      Name  Age     City  Score
0    Alice   21    Delhi     45
1      Bob   54   Mumbai     90
2  Charlie   22     Pune     87
3    David   43  Chennai     78
4     Emma   22    Delhi     99
5    Frank   55   Mumbai    100

In [186]:
a ={
    "Name": ["Alice","Bob","Charlie","David","Emma"],
    "Age": [21,None,22,23,32], 
    "City": ["Delhi","Mumbai",None,"Bangalore","Chennai"],
    "Score": [56,77,np.nan,88,87]
}

df =pd.DataFrame(a)

In [187]:
df

      Name   Age       City  Score
0    Alice  21.0      Delhi   56.0
1      Bob   NaN     Mumbai   77.0
2  Charlie  22.0       None    NaN
3    David  23.0  Bangalore   88.0
4     Emma  32.0    Chennai   87.0

In [188]:
df.isnull().sum()

Name     0
Age      1
City     1
Score    1
dtype: int64

In [189]:
df.head()

      Name   Age       City  Score
0    Alice  21.0      Delhi   56.0
1      Bob   NaN     Mumbai   77.0
2  Charlie  22.0       None    NaN
3    David  23.0  Bangalore   88.0
4     Emma  32.0    Chennai   87.0

In [190]:
df['Age'] =df['Age'].fillna(df['Age'].mean())

In [191]:
df

      Name   Age       City  Score
0    Alice  21.0      Delhi   56.0
1      Bob  24.5     Mumbai   77.0
2  Charlie  22.0       None    NaN
3    David  23.0  Bangalore   88.0
4     Emma  32.0    Chennai   87.0

In [192]:
df['Score'] =df['Score'].fillna(df['Score'].mean())
df['City'] =df['City'].fillna(df['City'].mode())

In [193]:
df

      Name   Age       City  Score
0    Alice  21.0      Delhi   56.0
1      Bob  24.5     Mumbai   77.0
2  Charlie  22.0      Delhi   77.0
3    David  23.0  Bangalore   88.0
4     Emma  32.0    Chennai   87.0

In [194]:
df['Score'] =df['Score'].astype(float)

In [195]:
df

      Name   Age       City  Score
0    Alice  21.0      Delhi   56.0
1      Bob  24.5     Mumbai   77.0
2  Charlie  22.0      Delhi   77.0
3    David  23.0  Bangalore   88.0
4     Emma  32.0    Chennai   87.0

In [196]:
import numpy as np 
import pandas as pd 

data ={
    "Name": ['Alice','Bob','Charlie','David','Alice',None], 
    "Age": ['25','30',None,'40','25','30'], 
    "City": ['Delhi','Mumbai','Pune','Banglore','Delhi','Mumbai'], 
    "Score": [85,None,78,85,91,88], 
    "Extra": ['x','y','z','x','y','z']
}

df =pd.DataFrame(data)

In [197]:
df

      Name   Age      City  Score Extra
0    Alice    25     Delhi   85.0     x
1      Bob    30    Mumbai    NaN     y
2  Charlie  None      Pune   78.0     z
3    David    40  Banglore   85.0     x
4    Alice    25     Delhi   91.0     y
5     None    30    Mumbai   88.0     z

In [198]:
df.isnull().sum()

Name     1
Age      1
City     0
Score    1
Extra    0
dtype: int64

In [392]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    0 non-null      float64
 1   Age     5 non-null      object
 2   City    6 non-null      object
 3   Score   5 non-null      float64
 4   Extra   6 non-null      object
dtypes: float64(2), object(3)
memory usage: 372.0+ bytes

In [400]:
df

  Name   Age      City  Score Extra
0  NaN    25     Delhi   85.0     x
1  NaN    30    Mumbai    NaN     y
2  NaN  None      Pune   78.0     z
3  NaN    40  Banglore   85.0     x
4  NaN    25     Delhi   91.0     y
5  NaN    30    Mumbai   88.0     z

In [402]:
df.isnull().sum()

Name     6
Age      1
City     0
Score    1
Extra    0
dtype: int64

In [404]:
import numpy as np 
import pandas as pd 

data ={
    "Name": ['Alice','Bob','Charlie','David','Alice',None], 
    "Age": ['25','30',None,'40','25','30'], 
    "City": ['Delhi','Mumbai','Pune','Banglore','Delhi','Mumbai'], 
    "Score": [85,None,78,85,91,88], 
    "Extra": ['x','y','z','x','y','z']
}

df =pd.DataFrame(data)

In [406]:
df.head()

      Name   Age      City  Score Extra
0    Alice    25     Delhi   85.0     x
1      Bob    30    Mumbai    NaN     y
2  Charlie  None      Pune   78.0     z
3    David    40  Banglore   85.0     x
4    Alice    25     Delhi   91.0     y

In [408]:
df.isnull().sum()

Name     1
Age      1
City     0
Score    1
Extra    0
dtype: int64

In [410]:
df.dropna(inplace=True)

In [412]:
df

    Name Age      City  Score Extra
0  Alice  25     Delhi   85.0     x
3  David  40  Banglore   85.0     x
4  Alice  25     Delhi   91.0     y

In [414]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      object
 2   City    3 non-null      object
 3   Score   3 non-null      float64
 4   Extra   3 non-null      object
dtypes: float64(1), object(4)
memory usage: 144.0+ bytes

In [416]:
df['Age'] =df['Age'].astype(int)

In [418]:
df

    Name  Age      City  Score Extra
0  Alice   25     Delhi   85.0     x
3  David   40  Banglore   85.0     x
4  Alice   25     Delhi   91.0     y

In [424]:
data ={
    "Name" : ["A","B","C","D"],
    "Age" : [21,22,33,12],
    "Score" :[78,87,98,76]
}
df =pd.DataFrame(data)

In [426]:
df.head()

  Name  Age  Score
0    A   21     78
1    B   22     87
2    C   33     98
3    D   12     76

In [438]:
df[df['Age']>20]

  Name  Age  Score
0    A   21     78
1    B   22     87
2    C   33     98

In [440]:
df[df['Age']<20]

  Name  Age  Score
3    D   12     76

In [447]:
import pandas as pd 
import numpy as np

data ={
    "product" :["pen","Notebook","Pencil","Marker","Eraser","Sharpener"], 
    "Price" :[10,50,5,30,8,12], 
    "Stock" :[100,60,200,80,150,120], 
    "Rating" :[4.5,4.7,4.9,4.3,5.5,4.2]
}

df =pd.DataFrame(data)

In [451]:
df.head()

    product  Price  Stock  Rating
0       pen     10    100     4.5
1  Notebook     50     60     4.7
2    Pencil      5    200     4.9
3    Marker     30     80     4.3
4    Eraser      8    150     5.5

In [455]:
df.sort_values(by ='Price')

     product  Price  Stock  Rating
2     Pencil      5    200     4.9
4     Eraser      8    150     5.5
0        pen     10    100     4.5
5  Sharpener     12    120     4.2
3     Marker     30     80     4.3
1   Notebook     50     60     4.7

In [461]:
df.sort_values(by =['Price','Rating'])
df

     product  Price  Stock  Rating
0        pen     10    100     4.5
1   Notebook     50     60     4.7
2     Pencil      5    200     4.9
3     Marker     30     80     4.3
4     Eraser      8    150     5.5
5  Sharpener     12    120     4.2

In [463]:
df.describe()

           Price       Stock    Rating
count   6.000000    6.000000  6.000000
mean   19.166667  118.333333  4.683333
std    17.486185   50.760877  0.475044
min     5.000000   60.000000  4.200000
25%     8.500000   85.000000  4.350000
50%    11.000000  110.000000  4.600000
75%    25.500000  142.500000  4.850000
max    50.000000  200.000000  5.500000

In [1]:
import pandas as pd 
import numpy as np 

data ={
    "OrderID": [1001,1002,1003,1004,1005], 
    "OrderDate": ['2024-01-05','2024/01/12','15-01-2024','2024-01-20','20240125'],
    'Customer': ['Alice','Bob','Charlie','David','Emma'], 
    'Amount': [250,400,150,300,500]
    
}

df =pd.DataFrame(data)

In [3]:
df

   OrderID   OrderDate Customer  Amount
0     1001  2024-01-05    Alice     250
1     1002  2024/01/12      Bob     400
2     1003  15-01-2024  Charlie     150
3     1004  2024-01-20    David     300
4     1005    20240125     Emma     500

In [5]:
df.dtypes

OrderID       int64
OrderDate    object
Customer     object
Amount        int64
dtype: object

In [11]:
df['OrderDate'] =pd.to_datetime(df['OrderDate'],errors='coerce')

In [13]:
df.set_index(df['OrderDate'])

            OrderID  OrderDate Customer  Amount
OrderDate
2024-01-05     1001 2024-01-05    Alice     250
NaT            1002        NaT      Bob     400
NaT            1003        NaT  Charlie     150
2024-01-20     1004 2024-01-20    David     300
NaT            1005        NaT     Emma     500

In [15]:
df_idx =df.set_index(df['OrderDate'])

In [17]:
df_idx.resample('M')['Amount'].sum()

C:\Users\DELL\AppData\Local\Temp\ipykernel_4300\4289072798.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  df_idx.resample('M')['Amount'].sum()

OrderDate
2024-01-31    550
Name: Amount, dtype: int64

In [1]:
import pandas as pd 
import numpy as np 

data ={
    "Name": ['Alice','Bob','Charlie','David','Emma'], 
    "Math": [88,75,92,60,85], 
    "Science": [90,80,78,70,95]
}

df =pd.DataFrame(data)

In [3]:
df.head()

      Name  Math  Science
0    Alice    88       90
1      Bob    75       80
2  Charlie    92       78
3    David    60       70
4     Emma    85       95

In [7]:
df['Total_Marks'] =df[['Math','Science']].apply(lambda row: row.sum(),axis =1)

In [9]:
df

      Name  Math  Science  Total_Marks
0    Alice    88       90          178
1      Bob    75       80          155
2  Charlie    92       78          170
3    David    60       70          130
4     Emma    85       95          180

In [11]:
col_mean =df[['Math','Science']].apply(lambda col:col.mean())

In [13]:
col_mean

Math       80.0
Science    82.6
dtype: float64

In [15]:
def to_grade(s): 
    if s>=90: 
        return "A"
    elif s>=80: 
        return "B"
    else:
        return "C"
df['Math_Grade'] =df['Math'].apply(to_grade)

In [17]:
df

      Name  Math  Science  Total_Marks Math_Grade
0    Alice    88       90          178          B
1      Bob    75       80          155          C
2  Charlie    92       78          170          A
3    David    60       70          130          C
4     Emma    85       95          180          B

In [19]:
df['Science_Grade'] =df['Science'].apply(to_grade)

In [21]:
df

      Name  Math  Science  Total_Marks Math_Grade Science_Grade
0    Alice    88       90          178          B             A
1      Bob    75       80          155          C             B
2  Charlie    92       78          170          A             C
3    David    60       70          130          C             C
4     Emma    85       95          180          B             A